krkruk/stm32wb_mesh_packet_error_rate/Drivers/BSP/Components/ism330dhcx/ism330dhcx_reg.h
#define ISM330DHCX_SENSOR_HUB_3                 0x04U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_3_t;

#define ISM330DHCX_SENSOR_HUB_4                 0x05U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_4_t;

#define ISM330DHCX_SENSOR_HUB_5                 0x06U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_5_t;

#define ISM330DHCX_SENSOR_HUB_6                 0x07U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_6_t;

#define ISM330DHCX_SENSOR_HUB_7                 0x08U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_7_t;

#define ISM330DHCX_SENSOR_HUB_8                 0x09U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_8_t;

#define ISM330DHCX_SENSOR_HUB_9                 0x0AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_9_t;

