krkruk/stm32wb_mesh_packet_error_rate/Drivers/BSP/Components/ism330dhcx/ism330dhcx_reg.h
#define ISM330DHCX_SENSOR_HUB_10                0x0BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_10_t;

#define ISM330DHCX_SENSOR_HUB_11                0x0CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_11_t;

#define ISM330DHCX_SENSOR_HUB_12                0x0DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_12_t;

#define ISM330DHCX_SENSOR_HUB_13                0x0EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_13_t;

#define ISM330DHCX_SENSOR_HUB_14                0x0FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_14_t;

#define ISM330DHCX_SENSOR_HUB_15                0x10U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_15_t;

#define ISM330DHCX_SENSOR_HUB_16                0x11U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_16_t;

#define ISM330DHCX_SENSOR_HUB_17                0x12U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
   uint8_t bit0                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit7                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
   uint8_t bit7                    : 1;
   uint8_t bit6                    : 1;
   uint8_t bit5                    : 1;
   uint8_t bit4                    : 1;
   uint8_t bit3                    : 1;
   uint8_t bit2                    : 1;
   uint8_t bit1                    : 1;
   uint8_t bit0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism330dhcx_sensor_hub_17_t;

